; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v4 ?v1)
		(pred_1 ?v7)
		(pred_5 ?v2)
		(pred_3 ?v2)
		(pred_2 ?v7 ?v2)
		(pred_6)
		(pred_4 ?v7))

   (:action op_2
       :parameters  (?v8 ?v6)
       :precondition (and (not-eq ?v8 ?v6) 
                          (pred_5 ?v8) (pred_5 ?v6) (pred_3 ?v8))
       :effect (and  (pred_3 ?v6)
		     (not (pred_3 ?v8))))


   (:action op_3
       :parameters (?v3 ?v5)
       :precondition  (and  (pred_1 ?v3) (pred_5 ?v5)
			    (pred_2 ?v3 ?v5) (pred_3 ?v5) (pred_6))
       :effect (and (pred_4 ?v3)
		    (not (pred_2 ?v3 ?v5)) 
		    (not (pred_6))))

   (:action op_1
       :parameters  (?v3  ?v5)
       :precondition  (and  (pred_1 ?v3) (pred_5 ?v5)
			    (pred_4 ?v3) (pred_3 ?v5))
       :effect (and (pred_2 ?v3 ?v5)
		    (pred_6)
		    (not (pred_4 ?v3)))))

; problem
(define (problem ferry-l6-c3)
(:domain ferry)
(:objects obj_09 obj_07 obj_01 obj_06 obj_02 obj_04 
          obj_05 obj_08 obj_03 
)
(:init
(pred_5 obj_09)
(pred_5 obj_07)
(pred_5 obj_01)
(pred_5 obj_06)
(pred_5 obj_02)
(pred_5 obj_04)
(pred_1 obj_05)
(pred_1 obj_08)
(pred_1 obj_03)
(not-eq obj_09 obj_07)
(not-eq obj_07 obj_09)
(not-eq obj_09 obj_01)
(not-eq obj_01 obj_09)
(not-eq obj_09 obj_06)
(not-eq obj_06 obj_09)
(not-eq obj_09 obj_02)
(not-eq obj_02 obj_09)
(not-eq obj_09 obj_04)
(not-eq obj_04 obj_09)
(not-eq obj_07 obj_01)
(not-eq obj_01 obj_07)
(not-eq obj_07 obj_06)
(not-eq obj_06 obj_07)
(not-eq obj_07 obj_02)
(not-eq obj_02 obj_07)
(not-eq obj_07 obj_04)
(not-eq obj_04 obj_07)
(not-eq obj_01 obj_06)
(not-eq obj_06 obj_01)
(not-eq obj_01 obj_02)
(not-eq obj_02 obj_01)
(not-eq obj_01 obj_04)
(not-eq obj_04 obj_01)
(not-eq obj_06 obj_02)
(not-eq obj_02 obj_06)
(not-eq obj_06 obj_04)
(not-eq obj_04 obj_06)
(not-eq obj_02 obj_04)
(not-eq obj_04 obj_02)
(pred_6)
(pred_2 obj_05 obj_09)
(pred_2 obj_08 obj_07)
(pred_2 obj_03 obj_09)
(pred_3 obj_06)
)
(:goal
(and
(pred_2 obj_05 obj_02)
(pred_2 obj_08 obj_04)
(pred_2 obj_03 obj_09)
)
)

(:constraints
  (and
    (sometime-before  (pred_2 obj_05 obj_02) (pred_3 obj_07))
    (sometime-before  (pred_2 obj_08 obj_04) (pred_3 obj_09))
  )
)
)

; plan
1. (op_2 obj_06 obj_04)
   deleted: (pred_3 obj_06)
   added: (pred_3 obj_04)
   goals met: 1 of 3
2. (op_2 obj_04 obj_07)
   deleted: (pred_3 obj_04)
   added: (pred_3 obj_07)
   goals met: 1 of 3
3. (op_3 obj_08 obj_07)
   deleted: (pred_2 obj_08 obj_07) (pred_6)
   added: (pred_4 obj_08)
   goals met: 1 of 3
4. (op_2 obj_07 obj_04)
   deleted: (pred_3 obj_07)
   added: (pred_3 obj_04)
   goals met: 1 of 3
5. (op_2 obj_04 obj_02)
   deleted: (pred_3 obj_04)
   added: (pred_3 obj_02)
   goals met: 1 of 3
6. (op_1 obj_08 obj_02)
   deleted: (pred_4 obj_08)
   added: (pred_2 obj_08 obj_02) (pred_6)
   goals met: 1 of 3
7. (op_2 obj_02 obj_09)
   deleted: (pred_3 obj_02)
   added: (pred_3 obj_09)
   goals met: 1 of 3
8. (op_3 obj_05 obj_09)
   deleted: (pred_2 obj_05 obj_09) (pred_6)
   added: (pred_4 obj_05)
   goals met: 1 of 3
9. (op_2 obj_09 obj_02)
   deleted: (pred_3 obj_09)
   added: (pred_3 obj_02)
   goals met: 1 of 3
10. (op_1 obj_05 obj_02)
   deleted: (pred_4 obj_05)
   added: (pred_2 obj_05 obj_02) (pred_6)
   goals met: 2 of 3
11. (op_3 obj_08 obj_02)
   deleted: (pred_2 obj_08 obj_02) (pred_6)
   added: (pred_4 obj_08)
   goals met: 2 of 3
12. (op_2 obj_02 obj_04)
   deleted: (pred_3 obj_02)
   added: (pred_3 obj_04)
   goals met: 2 of 3
13. (op_1 obj_08 obj_04)
   deleted: (pred_4 obj_08)
   added: (pred_2 obj_08 obj_04) (pred_6)
   goals met: 3 of 3
